Reports/сфпИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>сфпИсторияЗвонков</Name>
			<Comment>Отчет по истории звонков</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Comment>Период отчёта</Comment>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>Вариант отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОтчета</Name>
					<Comment>Сотрудник отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Comment>Событие</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/сфпИсторияЗвонков/Forms/ФормаОтчета/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Функция формирует из строки подключения структуру параметров подключения
//
// Параметры:
//	СтрокаПодключения	- Строка	- Строка подключения
//
// Возвращаемое значение:
//	Структура	- Структура  параметров подключения
//
Функция ПолучитьСтруктуруПодключения(СтрокаПодключения)
	СтруктураПодключения = Новый Структура;
	СтруктураПодключения.Вставить("Пользователь",	"");
	СтруктураПодключения.Вставить("Пароль",			"");
	СтруктураПодключения.Вставить("Сервер",			"");
	СтруктураПодключения.Вставить("БазаДанных",		"");
	Пока Истина Цикл
		ПозицияКонца	= Найти(СтрокаПодключения, ";");
		ПозицияСередины	= Найти(СтрокаПодключения, "=");
		Если ПозицияСередины = 0 Тогда Прервать; КонецЕсли;
		Ключ = Лев(СтрокаПодключения, ПозицияСередины - 1);
		Если ПозицияКонца = 0 Тогда
			Значение = Сред(СтрокаПодключения, ПозицияСередины + 1);
			СтрокаПодключения = "";
		Иначе	
			Значение = Сред(СтрокаПодключения, ПозицияСередины + 1, ПозицияКонца - ПозицияСередины - 1);	 
			СтрокаПодключения = Сред(СтрокаПодключения, ПозицияКонца + 1); 
		КонецЕсли;	
		Если Ключ = "Data Source" Тогда
			СтруктураПодключения.Сервер = Значение;
		ИначеЕсли Ключ = "Initial Catalog" Тогда
			СтруктураПодключения.БазаДанных = Значение;
		ИначеЕсли Ключ = "User ID" Тогда
			СтруктураПодключения.Пользователь = Значение;
		ИначеЕсли Ключ = "Password" Тогда
			СтруктураПодключения.Пароль = Значение;
		КонецЕсли;	
	КонецЦикла;
	Возврат СтруктураПодключения;
КонецФункции // ПолучитьСтруктуруПодключенияПодключения()	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик команды формы "УстановитьИнтервал"
//
Процедура УстановитьИнтервал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Отчет.ПериодОтчета;
	Если Диалог.Редактировать() Тогда 
	    Отчет.ПериодОтчета = Диалог.Период;
	КонецЕсли;
КонецПроцедуры // УстановитьИнтервал()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("сфпУправлениеМаршрутизацией") Тогда
		Сообщить(НСтр("ru='Недостаточно прав для просмотра отчета!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	СтрокаПодключения = Константы.сфпСтрокаПодключенияИстории.Получить();
	Если ПустаяСтрока(СтрокаПодключения) Тогда
		Сообщить(НСтр("ru='Ошибка отсутствуют параметры подключения к истории звонков'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СтруктураПодключения	= ПолучитьСтруктуруПодключения(СтрокаПодключения);
	ВнешниеИсточникиДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.РазорватьСоединение();
	ПараметрыСоединения = ВнешниеИсточникиДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.ПолучитьОбщиеПараметрыСоединения();
	ПараметрыСоединения.АутентификацияСтандартная	= Истина;
	ПараметрыСоединения.ИмяПользователя				= СтруктураПодключения.Пользователь;
	ПараметрыСоединения.Пароль						= СтруктураПодключения.Пароль;
	ПараметрыСоединения.СтрокаСоединения			= "DRIVER={SQL Server};SERVER=" + СтруктураПодключения.Сервер + ";UID=" 
		+ СтруктураПодключения.Пользователь + ";PWD=" + СтруктураПодключения.Пароль + ";DATABASE="
		+ СтруктураПодключения.БазаДанных + ";LANGUAGE=русский";
	ПараметрыСоединения.СУБД						= "MSSQLServer";
	ВнешниеИсточникиДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.УстановитьОбщиеПараметрыСоединения(ПараметрыСоединения);
	ВнешниеИсточникиДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.УстановитьСоединение();
	СостояниеПодключения = ВнешниеИсточникиДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.ПолучитьСостояние();
	Если СостояниеПодключения = СостояниеВнешнегоИсточникаДанных.Отключен Тогда
		Сообщить(НСтр("ru='Ошибка подключения к истории звонков'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если Параметры.Свойство("ВариантОтчета") Тогда
		ОтчетОбъект.ВариантОтчета = Параметры.ВариантОтчета;
		ПриЗагрузкеВариантаНаСервере(Неопределено);
	КонецЕсли;	
	Если Параметры.Свойство("СотрудникОтчета") Тогда
		ОтчетОбъект.СотрудникОтчета = Параметры.СотрудникОтчета;
	КонецЕсли;	
	Если Параметры.Свойство("Событие") Тогда
		ОтчетОбъект.Событие = Параметры.Событие;
	КонецЕсли;	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события формы "ПриЗагрузкеВариантаНаСервере"
//
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Отчет.ВариантОтчета = КлючТекущегоВарианта;
	Если Отчет.ВариантОтчета = "ЕженедельныйОтчет" Тогда
		Отчет.ПериодОтчета.Вариант		= ВариантСтандартногоПериода.ЭтаНеделя;
		Элементы.Сотрудник.Доступность	= Истина;
	ИначеЕсли Отчет.ВариантОтчета = "ОтчетПоСовершеннымЗвонкам" Тогда
		Элементы.Сотрудник.Доступность	= Истина;
	ИначеЕсли Отчет.ВариантОтчета = "ОтчетПоВсемЗвонкам" Тогда
		Элементы.Сотрудник.Доступность	= Ложь;
	Иначе	
		Отчет.ПериодОтчета.Вариант 		= ВариантСтандартногоПериода.Сегодня;
		Элементы.Сотрудник.Доступность	= Ложь;
	КонецЕсли;	
КонецПроцедуры // ПриЗагрузкеВариантаНаСервере()
